{"meta":{"title":"T3DdY's Thinking Cage","subtitle":"","description":"","author":"T3DdY","url":"https://tedlc.github.io/en","root":"/en/"},"pages":[{"title":"categories","date":"2023-05-08T02:01:11.000Z","updated":"2023-05-09T06:53:09.000Z","comments":true,"path":"categories/index.html","permalink":"https://tedlc.github.io/en/categories/index.html","excerpt":"","text":""},{"title":"About Me","date":"2023-05-09T05:43:28.000Z","updated":"2023-05-09T08:10:17.000Z","comments":true,"path":"about/index.html","permalink":"https://tedlc.github.io/en/about/index.html","excerpt":"","text":"GeneralI am T3DdY (He&#x2F;His&#x2F;Him), a software engineer focusing on system engineering. I also developed my interest in AI research including deep learning, AIoT, and computer vision. I am currently a graduate student at Carnegie Mellon, where I engrave “My heart is in the work” in my soul. EducationMaster’sCarnegie Mellon University (Expected: 2024) M.S. in Computer Engineering M.S. in Engineering &amp; Technology Innovation Bachlor’sUniversity of Michigan, Ann Arbor (Conferred: 2022) B.S. in Honors Computer Science B.S. in Mathematics Research Experience 2018-2019: Advised by Prof. Wang for wireless sensor network and computer vision lab. 2019-2021: Advised by Prof. Jianfei Yang at the Nanyang Technological University, Singapore. 2021-2022: Advised by Prof. Ambuj Tewari, Dr. Ziping Xu at the University of Michigan. 2022-Present: Advised by Prof. Paramveer Dhillon and Prof. Yixin Wang at the University of Michigan, and completed my Honors thesis. Publications 2020: Multi-target Tracking and Detection Based on Hybrid Filter Algorithm. IEEE 2020 2022: Addressing Hazy Image Recognition by Unsupervised Domain Adaptation. ICARCV 2022 2022: Enhancing Image Recognition by Multi-view Representation Learning. Honors Thesis 2022 RolesI have several role to which I contribute most of my time: Software Engineer AI Researcher Future Entrepreneur Professional Rubik’s Cube Player Photographer and Videographer Lifetime Learner Best kid of his parents. InterestsI have tons of hobbies: Rubik’s Cube: I can easily solve a Rubik’s Cube within 15 seconds. Taekwondo: I received the Second Degree of Black Belt. Fitness: I do powerlifting and body building. Racing: I am a Porsche enthusiasts, and I do casual racing. Skiing: I really enjoy skiing, and only skiing, not snowboarding. Drones: I am an FAA registered commercial UAS pilot with industrial operating experience. Harware Lunatics: I am obsessed with ALL computer hardwares. HerHer name is Cindy. She is alway there to support my strange ideas and always there when I need her. I am really proud of her being a part of Kellogg @ Northwestern."},{"title":"Tags","date":"2023-05-08T02:00:30.000Z","updated":"2023-05-09T07:02:00.000Z","comments":true,"path":"tags/index.html","permalink":"https://tedlc.github.io/en/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"About Me","slug":"about_me_en","date":"2023-04-25T04:00:00.000Z","updated":"2024-04-02T18:36:32.733Z","comments":true,"path":"2023/04/25/about_me_en/","link":"","permalink":"https://tedlc.github.io/en/2023/04/25/about_me_en/","excerpt":"GeneralI am T3DdY, a software engineer focusing on system engineering. I also developed my interest in AI research including deep learning, AIoT, and computer vision. I am currently a graduate student at Carnegie Mellon, where I engrave “My heart is in the work” in my soul.","text":"GeneralI am T3DdY, a software engineer focusing on system engineering. I also developed my interest in AI research including deep learning, AIoT, and computer vision. I am currently a graduate student at Carnegie Mellon, where I engrave “My heart is in the work” in my soul. EducationMaster’sCarnegie Mellon University (Expected: 2024) M.S. in Computer Engineering Bachlor’sUniversity of Michigan, Ann Arbor (Conferred: 2022) B.S. in Honors Computer Science B.S. in Mathematics Research Experience 2018-2019: Advised by Prof. Wang for wireless sensor network and computer vision lab. 2019-2021: Advised by Prof. Jianfei Yang at the Nanyang Technological University, Singapore. 2021-2022: Advised by Prof. Ambuj Tewari, Dr. Ziping Xu at the University of Michigan. 2022-Present: Advised by Prof. Paramveer Dhillon and Prof. Yixin Wang at the University of Michigan, and completed my Honors thesis. Publications 2020: Multi-target Tracking and Detection Based on Hybrid Filter Algorithm. IEEE 2020 2022: Addressing Hazy Image Recognition by Unsupervised Domain Adaptation. ICARCV 2022 2022: Enhancing Image Recognition by Multi-view Representation Learning. Honors Thesis 2022 RolesI have several role to which I contribute most of my time: Software Engineer AI Researcher Future Entrepreneur Professional Rubik’s Cube Player Photographer and Videographer Lifetime Learner Best kid of his parents. InterestsI have tons of hobbies: Rubik’s Cube: I can easily solve a Rubik’s Cube within 15 seconds. Taekwondo: I received the Second Degree of Black Belt. Fitness: I do powerlifting and body building. Racing: I am a Porsche enthusiasts, and I do casual racing. Skiing: I really enjoy skiing, and only skiing, not snowboarding. Drones: I am an FAA registered commercial UAS pilot with industrial operating experience. Harware Lunatics: I am obsessed with ALL computer hardwares. HerHer name is Xinyu Gu. She is alway there to support my strange ideas and always there when I need her. I am really proud of her being a part of Kellogg @ Northwestern.","categories":[{"name":"Personal","slug":"Personal","permalink":"https://tedlc.github.io/en/categories/Personal/"}],"tags":[{"name":"T3DdY","slug":"T3DdY","permalink":"https://tedlc.github.io/en/tags/T3DdY/"}]}],"categories":[{"name":"Personal","slug":"Personal","permalink":"https://tedlc.github.io/en/categories/Personal/"}],"tags":[{"name":"T3DdY","slug":"T3DdY","permalink":"https://tedlc.github.io/en/tags/T3DdY/"}]}